################################################################################
# SPDX-FileCopyrightText: Copyright (c) 2026 NVIDIA CORPORATION & AFFILIATES. All rights reserved.
# SPDX-License-Identifier: Apache-2.0
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
# http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
################################################################################

name: "triton_custom_backend_ensemble"
platform: "ensemble"
max_batch_size: 16
input [
  {
    name: "OBJECT"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 224, 224]
  },
  {
    name: "STREAM_ID"
    data_type: TYPE_INT32
    dims: [1]
  }
]
output [
  {
    name: "VEHICLE_MAKE"
    data_type: TYPE_FP32
    dims: [20]
  },
  {
    name: "VEHICLE_TYPE"
    data_type: TYPE_FP32
    dims: [6]
  },
  {
    name: "INFERENCE_COUNT"
    data_type: TYPE_INT32
    dims: [1]
  }

]
ensemble_scheduling {
  step [
    {
      model_name: "deepstream_triton_custom_cpp_backend"
      model_version: 1
      input_map {
        key: "INPUT"
        value: "STREAM_ID"
      }
      output_map {
    key: "OUTPUT"
        value: "INFERENCE_COUNT"
      }
    },
    {
      model_name: "Secondary_VehicleMake"
      model_version: 1
      input_map {
        key: "input_1:0"
        value: "OBJECT"
      }
      output_map {
        key: "predictions/Softmax:0"
        value: "VEHICLE_MAKE"
      }
    },
    {
      model_name: "Secondary_VehicleTypes"
      model_version: 1
      input_map {
        key: "input_1:0"
        value: "OBJECT"
      }
      output_map {
        key: "predictions/Softmax:0"
        value: "VEHICLE_TYPE"
      }
    }
  ]
}
